import requests
import time
import pyfiglet
import datetime
open('.token.txt', 'w').write(' . . . .')
import requests
import random
import threading
E = '\x1b[1;31m'
Z = '\x1b[1;31m'
R = '\x1b[1;31m'
X = '\x1b[1;33m'
F = '\x1b[2;32m'
C = '\x1b[1;97m'
B = '\x1b[2;36m'
Y = '\x1b[1;34m'
E = '\x1b[1;31m'
B = '\x1b[2;36m'
G = '\x1b[1;32m'
S = '\x1b[1;33m'
C1 = '\x1b[2;35m'
G = '\x1b[1;35m'
Z = '\x1b[1;31m'
X = '\x1b[1;33m'
Z1 = '\x1b[2;31m'
F = '\x1b[2;32m'
A = '\x1b[2;34m'
C = '\x1b[2;35m'
B = '\x1b[2;36m'
Y = '\x1b[1;34m'
M = '\x1b[1;37m'
S = '\x1b[1;33m'
U = '\x1b[1;37m'
BRed = '\x1b[1;31m'
BGreen = '\x1b[1;32m'
BYellow = '\x1b[1;33m'
BBlue = '\x1b[1;34m'
BPurple = '\x1b[1;35m'
BCyan = '\x1b[1;36m'
BWhite = '\x1b[1;37m'
import requests
import sys
import os
import time
import pyfiglet
import requests
import colorama
import mechanize
from tokenize import cookie_re
import requests
import requests
import os
import names
import json
import random
import requests
import os
import names
import random
import time
from user_agent import generate_user_agent
from uuid import uuid4
uid = uuid4()
import requests
import random
import mechanize
import time
import requests
import random
import mechanize
import datetime
now = datetime.datetime.today()
now = datetime.datetime.today()
mm = str(now.month)
dd = str(now.day)
yyyy = str(now.year)
hour = str(now.hour)
mi = str(now.minute)
ss = str(now.second)
t = mm + '/' + dd + '/' + yyyy + ' ' + hour + ':' + mi + ':' + ss
hours = now.hour
x = datetime.datetime.now()
g = datetime.datetime(2024, 11, 23, 20, 0, 0)
if x.strftime('%x') > g.strftime('%x'):
    print('\n\n')
    print('     تم توقيف اداة راسل المبرمج لتفعيله @gj_ggj @bsx_h2')
    print('\n\n')
    print(x)
    exit(0)
if x.strftime('%x') == g.strftime('%x'):
    print('')
    if x.strftime('%X') > g.strftime('%X'):
        print('\n\n')
        print('     خلص اشتراك عليك مراجعة صانع اداة @bsx_h2☄️🗿')
        print('\n\n')
        print(x)
        exit(0)
    else:
        print('')
else:
    print('')
print('')
Z = '\x1b[1;31m'
X = '\x1b[1;33m'
F = '\x1b[2;32m'
C = '\x1b[1;97m'
B = '\x1b[2;36m'
Y = '\x1b[1;34m'
C = '\x1b[1;97m'
E = '\x1b[1;31m'
B = '\x1b[2;36m'
G = '\x1b[1;32m'
S = '\x1b[1;33'
J = '\x1b[38;5;158m'
import webbrowser
webbrowser.open('https://t.me/bsx_h2')
print(J + '▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄')
print('\n\x1b[38;5;196m\n\n⠀⠀⠀⠀⠀⠀⠀⣀⣤⣶⣿⠷⠾⠛⠛⠛⠛⠷⠶⢶⣶⣤⣄⡀⠀   ⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⣀⣴⡾⠛⠉⠁⠀⣰⡶⠶⠶⠶⠶⠶⣶⡄⠀⠉⠛⠿⣷⣄⡀    ⠀⠀⠀\n⠀⠀⣠⣾⠟⠁⠀⠀⠀⠀⠀⢸⡇⠀⠀⠀⠀⠀⣼⠃⠀⠀⠀⠀⠈⠛⢿⣦⡀     ⠀  \n⢠⣼⠟⠁⠀⠀⠀⠀⣠⣴⣶⣿⡇⠀⠀⠀⠀⠀⣿⣷⣦⣄⠀⠀⠀⠀⠀⠙⣧        ⡀\n⣿⡇⠀⠀⠀⢀⣴⣾⣿⣿⣿⣿⣇⠀⠀⠀⠀⠸⣿⣿⣿⣿⣿⣦⡀⠀⠀⠀⢈         ⣷\n⣿⣿⣦⡀⣠⣾⣿⣿⣿⡿⠟⢻⣿⠀⠀⠀⠀⢠⣿⠻⢿⣿⣿⣿⣿⣆⣀⣠⣾       ⣿\n⠉⠻⣿⣿⣿⣿⣽⡿⠋⠀⠀⠸⣿⠀⠀⠀⠀⢸⡿⠀⠀⠉⠻⣿⣿⣿⣿⣿⠟        ⠁\n⠀⠀⠈⠙⠛⣿⣿⠀⠀⠀⠀⢀⣿⠀⠀⠀⠀⢸⣇⠀⠀⠀⠀⣹⣿⡟⠋⠁     ⠀⠀\n⠀⠀⠀⠀⠀⢿⣿⣷⣄⣀⣴⣿⣿⣤⣤⣤⣤⣼⣿⣷⣀⣀⣾⣿⣿⠇⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠈⠻⢿⣿⣿⣿⣿⣿⠟⠛⠛⠻⣿⣿⣿⣿⣿⡿⠛⠉⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠉⠉⠁⣿⡇⠀⠀⠀⠀⢸⣿⡏⠙⠋⠁⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣷⣄⠀⠀⣀⣾⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢿⣿⣿⣿⣿⣿⣏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n')
print('')
print(J + '▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄')
print('\x1b[1;34m\n\n      𝑇𝑂𝑂𝐿𝑆 𓄌 ⚜️ 𝑹𝑴𝑨𝑫 ⚜️         \n\n⠀⠀\n')
print()
print(F + '  𝑇𝐼𝐾' + Y + '𝑇𝑂𝐾⏜ ' + E + 'ＴＯ' + B + 'ＯＬ  ' + Z)
print(J + '★✰★✰★✰★✰★✰★✰★✰★✰★✰★✰★✰★✰★✰★✰★✰★✰★✰★✰★✰★✰')
print('')
print(' \x1b[1;34m  ⚜️ 𝑹𝑴𝑨𝑫 ⚜️ @bsx_h2     ')
print()
print(J + '★✰★✰★✰★✰★✰★✰★✰★✰★✰★✰★✰★✰★✰★✰★✰★✰★✰★✰★✰★✰')
print()
token = input('  \x1b[1;35m 𝙏𝙊𝙆𝙀𝙉  ╭☞  \x1b[2;32m  ')
print()
print(' ━━━━━━━━━━━━━━━━━━━━━ ')
print()
ID = input(' \x1b[2;32m \x1b[1;35m 𝙄𝘿   ╭☞  \x1b[2;32m  ')
print()
print('\x1b[2;36m   جاري الاتصال انتضر قليلاً ...... ')
print(B + '________________________________________')
import requests

def sui():
    
    try:
        user = '1234567890.asdfghjklqwertyuiopzxcvbnm'
        num = ('Michael', 'Christopher', 'Jessica', 'Matthew', 'Ashley', 'Jennifer', 'Joshua', 'Amanda', 'David', 'Daniel', 'James', 'Robert', 'John', 'Joseph', 'Andrew', 'Ryan', 'Brandon', 'Jason', 'Justin', 'Sarah', 'William', 'Jonathan', 'Stephanie', 'Brian', 'Nicole', 'Nicholas', 'Anthony', 'Heather', 'Elizabeth', 'Megan', 'Adam', 'Eric', 'Melissa', 'Kevin', 'Steven', 'Thomas')
        rang = None((lambda .0 = None: for i in .0:
random.choice(num))(range(1)))
        name = None((lambda .0 = None: for i in .0:
random.choice(user))(range(6)))
        username = name
        email = name + '@gmail.com'
        res = requests.get(f'''https://GmailandTiktokandzaid.zaidbot.repl.co/2/email={email}''').text
        if '"Dev":"@bsx_h2","Email":"Good"' in res:
            print(f'''{F}Good Email : {email}''')
        api = requests.get(f'''https://api.dlyar-dev.tk/info-tiktok.json?user={username}''').json()
        if api['status'] == True:
            name = api['name']
            followers = api['followers']
            following = api['following']
            like = api['likes']
            id = api['id']
            code = api['code-country']
            country = api['country']
            tlg = f'''\n𝑇𝐼𝐾𝑇𝑂𝐾 𓅇\n\n꧁R꧂꧁M꧂꧁A꧂꧁D꧂\n\n𝖓??𝖒𝖊 -  : {name}\n \n𝗨𝐒𝐄𝐑𝐍𝐀𝐌𝐄┊@{username}\n \n𝗘𝗠𝗔i𝗜 ⁞ {email}\n \nIᗪ  ⚡️?? •|•℡: {id} \n \n𝗨 𝗥 𝗜 -﴿ : https://www.tiktok.com/@{username}\n \n꧁R꧂꧁M꧂꧁A꧂꧁D꧂\n\nPY : @bsx_h2 || @GJ_GGJ\n\t\t'''
            tlg = f'''\n𝑇𝐼𝐾𝑇𝑂𝐾 𓅇\n\n꧁R꧂꧁M꧂꧁A꧂꧁D꧂\n\n𝖓??𝖒𝖊 -  : {name}\n \n𝗨𝐒𝐄𝐑𝐍𝐀𝐌𝐄┊@{username}\n \n𝗘𝗠𝗔i𝗜 ⁞ {email}\n \nIᗪ  ⚡️?? •|•℡: {id} \n \n𝗨 𝗥 𝗜 -﴿ : https://www.tiktok.com/@{username}\n \n꧁R꧂꧁M꧂꧁A꧂꧁D꧂\n\nPY : @bsx_h2|| @gj_ggj\n\t\t\n\t\t'''
            requests.get('https://api.telegram.org/bot' + str(token) + '/sendMessage?chat_id=' + str(ID) + '&text=' + str(tlg))
            print(tlg)
        else:
            os.system('clear')
            print('\x1b[2;31m\n\n\x1b[38;5;48m\n :::::::..       .        :         :::.         :::::::-.  \n\x1b[38;5;208m;;;;``;;;;      ;;,.    ;;;        ;;`;;         ;;,   `\';,\n \x1b[38;5;169m[[[,/[[[\'      [[[[, ,[[[[,      ,[[ \'[[,       `[[     [[\n\x1b[1;34m $$$$$$c        $$$$$$$$"$$$     c$$$cc$$$c      \x1b[38;5;228m $$,    $$\n 888b "88bo,    888 Y88" 888o     888   888,      \x1b[38;5;117m888_,o8P\'\n MMMM   "W"     MMM  M\'  "MMM     YMM   ""`       MMMMP"`  \n  \x1b[38;5;181m\n  \n     جاري الصيد انتضر من فضلك ......\n\n   \n  \n     \n        \x1b[2;31m\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⢀⡀⡀⢀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⢰⠓⠉⡋⠀⠀⠀⡨⠀⠀⢰⠁⠀⠀⠀⠀⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠘⠀⠀⢸⠀⠀⠀⡔⠀⠀⢸⠀⠀⠀⢀⡎⠀⠀⠀⠀⠀⠀⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠰⠃⠀⠀⡆⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⢸⠀⠀⢸⠀⠀⠀⡇⠀⠀⠀⠓⠒⠃⠎⠀⠀⠀⠀⠀⠀⡈⠀⠀⠀⠀⠀⠀⠀⠀⠀⠢⠀⠀⠀⡌⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠞⠀⠀⠈⠀⠀⠀⠀⠀⠀⠀⢀⠔⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⡠⢀⠃⠈⠑⢲⠂⠐⢀⠶⡸⠀⠀⠴⡖⠲⢄⡄⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⠁⠀⡇⠀⠀⠠⠃⠀⡦⠁⠨⠆⠀⡜⠀⡇⠀⣧⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡒⠀⠀⠀⣆⠔⠒⠁⠀⠀⠓⢰⠖⠘⠊⠠⠀⠇⡜⠀⢣\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠔⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠧⠃⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡤⡊⠋⠁⠁⠁⡩⢫⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡃⠀⠀⠀⢠⡮⠚⠁⠡⠀⠀⠀⠀⢀⡠⠏⠀⠀⠀⠀⠀⠀⠀⠄⠒⠲⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠒⠒⢉⠆⠀⠀⠀⠀⠀⠀⠠⠈⠀⠀⡊⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⠄⠄⠀⡀⠀⡌⡀⠔⠘⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠒⠒⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡰⡺⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⠋⣰⣒⡲⠖⡆⠀⠀⢠⠖⠒⠒⠲⣌⠛⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠼⠋⡁⠀⠀⠀⠇⠀⠃⠀⣠⠖⠀⠀⠀⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣇⣉⣉⡷⠀⠀⠀⠀⡏⠉⠒⢒⠆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡤⢤⠀⠀⠓⠒⠒⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⠋⠀⢠⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡠⠤⠶⠶⠨⠟⠛⠓⠒⡒⢤⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠓⠒⠠⠤⠂⠒⠀⠉⠓⠉⠁   \n       \n         \n             ')
    except:
        pass
    os.system('clear')
    print('\x1b[2;33m\n\n\x1b[38;5;48m\n :::::::..       .        :         :::.         :::::::-.  \n\x1b[38;5;208m;;;;``;;;;      ;;,.    ;;;        ;;`;;         ;;,   `\';,\n \x1b[38;5;169m[[[,/[[[\'      [[[[, ,[[[[,      ,[[ \'[[,       `[[     [[\n\x1b[1;34m $$$$$$c        $$$$$$$$"$$$     c$$$cc$$$c      \x1b[38;5;228m $$,    $$\n 888b "88bo,    888 Y88" 888o     888   888,      \x1b[38;5;117m888_,o8P\'\n MMMM   "W"     MMM  M\'  "MMM     YMM   ""`       MMMMP"`  \n \n \x1b[38;5;194m\n\n  جاري الصيد انتضر من فضلك ......\n  \n    \n      \n        \n          \x1b[2;36m\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⢀⡀⡀⢀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⢰⠓⠉⡋⠀⠀⠀⡨⠀⠀⢰⠁⠀⠀⠀⠀⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠘⠀⠀⢸⠀⠀⠀⡔⠀⠀⢸⠀⠀⠀⢀⡎⠀⠀⠀⠀⠀⠀⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠰⠃⠀⠀⡆⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⢸⠀⠀⢸⠀⠀⠀⡇⠀⠀⠀⠓⠒⠃⠎⠀⠀⠀⠀⠀⠀⡈⠀⠀⠀⠀⠀⠀⠀⠀⠀⠢⠀⠀⠀⡌⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠞⠀⠀⠈⠀⠀⠀⠀⠀⠀⠀⢀⠔⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⡠⢀⠃⠈⠑⢲⠂⠐⢀⠶⡸⠀⠀⠴⡖⠲⢄⡄⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⠁⠀⡇⠀⠀⠠⠃⠀⡦⠁⠨⠆⠀⡜⠀⡇⠀⣧⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡒⠀⠀⠀⣆⠔⠒⠁⠀⠀⠓⢰�\x1b[38;5;158m▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄\n\n\x1b[38;5;196m\n\n⠀⠀⠀⠀⠀⠀⠀⣀⣤⣶⣿⠷⠾⠛⠛⠛⠛⠷⠶⢶⣶⣤⣄⡀⠀   ⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⣀⣴⡾⠛⠉⠁⠀⣰⡶⠶⠶⠶⠶⠶⣶⡄⠀⠉⠛⠿⣷⣄⡀    ⠀⠀⠀\n⠀⠀⣠⣾⠟⠁⠀⠀⠀⠀⠀⢸⡇⠀⠀⠀⠀⠀⣼⠃⠀⠀⠀⠀⠈⠛⢿⣦⡀     ⠀  \n⢠⣼⠟⠁⠀⠀⠀⠀⣠⣴⣶⣿⡇⠀⠀⠀⠀⠀⣿⣷⣦⣄⠀⠀⠀⠀⠀⠙⣧        ⡀\n⣿⡇⠀⠀⠀⢀⣴⣾⣿⣿⣿⣿⣇⠀⠀⠀⠀⠸⣿⣿⣿⣿⣿⣦⡀⠀⠀⠀⢈         ⣷\n⣿⣿⣦⡀⣠⣾⣿⣿⣿⡿⠟⢻⣿⠀⠀⠀⠀⢠⣿⠻⢿⣿⣿⣿⣿⣆⣀⣠⣾       ⣿\n⠉⠻⣿⣿⣿⣿⣽⡿⠋⠀⠀⠸⣿⠀⠀⠀⠀⢸⡿⠀⠀⠉⠻⣿⣿⣿⣿⣿⠟        ⠁\n⠀⠀⠈⠙⠛⣿⣿⠀⠀⠀⠀⢀⣿⠀⠀⠀⠀⢸⣇⠀⠀⠀⠀⣹⣿⡟⠋⠁     ⠀⠀\n⠀⠀⠀⠀⠀⢿⣿⣷⣄⣀⣴⣿⣿⣤⣤⣤⣤⣼⣿⣷⣀⣀⣾⣿⣿⠇⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠈⠻⢿⣿⣿⣿⣿⣿⠟⠛⠛⠻⣿⣿⣿⣿⣿⡿⠛⠉⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠉⠉⠁⣿⡇⠀⠀⠀⠀⢸⣿⡏⠙⠋⠁⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣷⣄⠀⠀⣀⣾⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢿⣿⣿⣿⣿⣿⣏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n\n\n\x1b[38;5;158m▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄\n\x1b[1;34m\n')
    


Threads = []
for t in range(2):
    x = threading.Thread(sui, **('target',))
    x.start()
    Threads.append(x)
for Th in Threads:
    Th.join()
sui()



#:تم فك التشفير دز ادوات مدفوعة وافك تشفيرها 🔥
لتواصل  :  @TYY_313 
 قناتي التلكرام  :  @YIB_31
 مجموعتي التلكرام  :  @YIB_313